//
// Created by RobertVoropaev on 01.02.2016.
//

#include "Matrix.h"
#include "SquareMatrix.h"

using namespace std;

/*
 * Написать классы матрицы и квадратной матрицы.
 * Реализовать все часто используемые операции с матрицами: сложение матриц, умножение на число, перемножение матриц,
 * транспонирование, обращение к элементам матрицы по индексам, поиск детерминанта, операции ввода/вывода;
 * матрица размера 1х1 должна уметь преобразовываться в переменную типа элементов матрицы.
 */

int main() {
    return 0;
}